# ==========================================基础参数==========================================
# IS_NEW_DEV_LOGIN 是否是新设备登录
# 账号在新设备（模拟器）登录会有解锁动画和对话，=True 跳过这些，只有在稳定执行刷mana和完成每日的情况下才 =False 减少10%~30%耗时
# 不熟悉脚本代码的情况下，对脚本和脚本依赖资源有任何改动，都应设置为 =True 改动包括且不限于：修改代码、执行不同任务、调整脚本参数、修改账号文件，增加或删除模拟器
IS_NEW_DEV_LOGIN = True

# FARM_1_NAME 农场1会名
# FARM_2_NAME 农场2会名
# 行会名要确保唯一性，搜索结果只有你创建的这一个行会，脚本默认不支持中文输入，只能由英文和数字组成，不超过10个字符
# 使用脚本创建行会时，使用密码生成器（在网上搜）生成一串数字当名字，但注意不能含有‘89’和‘64’否则会敏感词创建失败，使用纯数字也是因为英文敏感词不明确很容易中招
FARM_1_NAME = '输入农场1行会名'
FARM_2_NAME = '输入农场2行会名'

BOSS = ['输入大号账号ID', '输入密码']  # 大号
FARM_1_LEADER = ['输入农场1会长ID', '输入密码']  # 农场1会长，如果使用脚本创建了行会，会长是账号文件里第一个账号
FARM_2_LEADER = ['输入农场2会长ID', '输入密码']  # 农场2会长

LOGIN_PARAMETERS = 0  # 登录参数 =0只有可可罗盖章； =1兰德索尔杯赛马；填其它值可能会出现问题

# 百度OCR
BAIDU_API_KEY = '输入申请到的百度ak'
BAIDU_SECRET_KEY = '输入申请到的百度sk'

# ==========================================高级参数==========================================
THRESHOLD = 0.8  # 图像识别的阈值
OPDELAY = 2  # 操作延迟（秒），截图、点击等操作之间的间隔
ADB_PATH = 'cd adb & '  # 默认 ='cd adb & ' 使用脚本自带的adb，如果电脑已经配置了adb环境变量且出现了adb相关问题，则可以=''尝试解决
IDENTIFY_ROUND = 5  # 重新识别次数最大值，当截图里没有识别到目标时，会重新截图识别，截图次数达到最大值后会跳过识别。此项也会影响OCR
LOADING_TIME = 6  # 读条、加载状态、解锁动画时的默认等待时间
